InformationRegisters/НДФЛИмущественныйВычет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НДФЛИмущественныйВычет</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Применяется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыПоКредиту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НДФЛИмущественныйВычет/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Применяется Тогда
			Запись.Представление = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сумма расхода:%1';uk='Сума витрати:%1'"), Запись.СуммаРасходов)
				+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru=', процент по кредиту:%1';uk=', відсоток за кредитом:%1'"), Запись.ПроцентыПоКредиту)
				+ ?(ЗначениеЗаполнено(Запись.КодИФНС), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru=', код ИФНС:%1';uk=', код ІФПС:%1'"),Запись.КодИФНС),"")
				+ ?(ЗначениеЗаполнено(Запись.НомерУведомления), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru=', номер уведомления:%1';uk=', номер повідомлення:%1'"),Запись.НомерУведомления),"")
				+ ?(ЗначениеЗаполнено(Запись.ДатаУведомления), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru=', дата уведомления:%1';uk=', дата повідомлення:%1'"),Запись.ДатаУведомления),"");
			Иначе
				Запись.Представление =  НСтр("ru='Имущественный вычет не применяется';uk='Майнове відрахування не застосовується'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
